Autodesk.Revit.DB.ExternalResourceReference.#ctor(System.Guid,System.Collections.Generic.IDictionary`2{System.String,System.String},System.String,System.String)
Creates a new ExternalResourceReference from the given data.
serverId:
The id of the server associated with this
ExternalResourceReference. The server must implement
IExternalResourceServer.
referenceInformation:
The (String, String) map containing reference or lookup information that will
be stored in Revit.
version:
The version of the external data.
inSessionPath:
The path that identifies a resource in server. ExternalResourceServer must provide this path which should not contain the server name.
Revit internally will construct and store the full display path which includes the server name plus this path at the time a resource
is loaded into the model for use if the server is missing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015